doc/uml/dot/components_device_siso.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"components.device_siso.Device_SISO" [color="black", fontcoor="black", 
              label="{Device_SISO|
               + devtype: str\l
               + energy: str\l 
               + name:str \l 
               + iPort: Port\l 
               + oPort: Port\l|
               + Device_SISO(dictDev)\l 
               + state()\l 
               + mass_balance()\l 
               + balance()\l 
               + __str()__:str\l}",
               shape="record", style="solid"];

"components.compressor.Compressor" [color="black", fontcoor="black", 
              label="{Compressor|
               + devtype: str\l
               + energy: str\l 
               + ef: float\l 
               + Wc: float\l|
               + Compressor(dictDev)\l
               + state()\l 
               + balance()\l 
               + __str()__:str\l}",
               shape="record", style="solid"];

"components.condenser.Condenser" [color="black", fontcoor="black", 
              label="{Condenser|
               + devtype: str\l
               + energy: str\l 
               + Qout: float\l|
               + Condenser(dictDev:dict)\l
               + state()\l 
               + balance()\l 
               + __str()__:str\l}",
               shape="record", style="solid"];

"components.evaporator.Evaporator" [color="black", fontcoor="black", 
              label="{Evaporator|
               + devtype: str\l
               + energy: str\l 
               + Qin: float\l|
               + Evaporator(dictDev:dict)\l
               + state()\l 
               + balance()\l 
               + __str()__:str\l}",
               shape="record", style="solid"];
"components.expansionvalue.ExpansionValue" [color="black", fontcoor="black", 
              label="{ExpansionValue|
               + devtype: str\l
               + energy: str\l|
               + state()\l}",
               shape="record", style="solid"];

"components.device_siso.Device_SISO"->"components.compressor.Compressor"[
            arrowhead="empty", arrowtail="none",
            style="solid"];

"components.device_siso.Device_SISO"->"components.condenser.Condenser"[
            arrowhead="empty", arrowtail="none",
            style="solid"];
"components.device_siso.Device_SISO"->"components.evaporator.Evaporator"[
            arrowhead="empty", arrowtail="none",
            style="solid"];
"components.device_siso.Device_SISO"->"components.expansionvalue.ExpansionValue"[
            arrowhead="empty", arrowtail="none",
            style="solid"];
}
